---
kind: method
id: M:Autodesk.Revit.DB.EdgeArray.#ctor
source: html/ff8ea573-fdb2-acdc-b718-3e5c9116a0ba.htm
---
# Autodesk.Revit.DB.EdgeArray.#ctor Method

Initializes a new instance of the EdgeArray class

## Syntax (C#)
```csharp
public EdgeArray()
```